## SQL查询语句

In [ ]:
%load_ext sql
%config SqlMagic.autocommit=True
%sql mssql+pyodbc://sa:Lily870104@MSSQLTest

In [9]:
%%sql use test1;
    commit;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.
Done.

[]

*prepare data*

In [10]:
%%sql create table employee(
    emp_id int primary key,
    first_name varchar(50) not null,
    last_name varchar(50) not null,
    mgr_id int,
    phone_number varchar(20),
    hire_date date,
    job_title varchar(20),
    dept_no int,
    salary money
    );
    commit

 * mssql+pyodbc://sa:***@MSSQLTest
Done.
Done.

[]

In [22]:
%sql select * from employee;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(1001, 'Allen', 'Finch', None, None, None, 'J7', 10, None),
 (1002, 'Scott', 'Tigger', 1001, None, None, 'J2', 10, None),
 (1003, 'Martin', 'Blake', 1001, None, None, 'J3', 10, None),
 (1004, 'Arun', 'Turner', None, None, datetime.date(2008, 6, 5), 'J4', 20, Decimal('40000.0000')),
 (1005, 'John', 'Root', 1004, None, datetime.date(2010, 1, 10), 'J5', 20, None),
 (1006, 'Nithya', 'Jones', 1001, None, datetime.date(1999, 2, 12), 'J6', 30, Decimal('500000.0000')),
 (1007, 'Smith', 'Ruth', 1006, None, datetime.date(2010, 7, 21), 'J1', 10, Decimal('30000.0000')),
 (1008, 'Miller', 'Ward', 1001, None, None, 'J8', 40, None),
 (1009, 'Alex', 'Fin', None, None, None, 'J7', 30, None)]

In [12]:
%%sql create table dept(
    dept_no int primary key,
    dept_name varchar(20),
    loc varchar(20)
    );

    commit;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.
Done.

[]

In [14]:
%%sql insert into employee(emp_id, first_name, last_name, mgr_id, phone_number, hire_date, job_title, dept_no, salary)
    values(1001, 'Allen', 'Finch', null, null, null, 'J7', 10, null),
    (1002, 'Scott', 'Tigger', 1001, null, null, 'J2', 10, null);
    commit;

 * mssql+pyodbc://sa:***@MSSQLTest
2 rows affected.
Done.

[]

In [17]:
%%sql insert into employee(emp_id, first_name, last_name, mgr_id, phone_number, hire_date, job_title, dept_no, salary)
    values(1003, 'Martin', 'Blake', 1001, null, null, 'J3', 10, null),
    (1004, 'Arun', 'Turner', 1001, null, '2008-06-05', 'J4', 20, 40000.0);
    commit;

 * mssql+pyodbc://sa:***@MSSQLTest
2 rows affected.
Done.

[]

In [19]:
%%sql update employee set mgr_id=null where emp_id=1004;
    commit;

 * mssql+pyodbc://sa:***@MSSQLTest
1 rows affected.
Done.

[]

In [21]:
%%sql insert into employee(emp_id, first_name, last_name, mgr_id, phone_number, hire_date, job_title, dept_no, salary)
    values(1005, 'John', 'Root', 1004, null, '2010-01-10', 'J5', 20, null),
    (1006, 'Nithya', 'Jones', 1001, null, '1999-02-12', 'J6', 30, 500000.0),
    (1007, 'Smith', 'Ruth', 1006, null, '2010-07-21', 'J1', 10, 30000.0),
    (1008, 'Miller', 'Ward', 1001, null, null, 'J8', 40, null),
    (1009, 'Alex', 'Fin', null, null, null, 'J7', 30, null);
    commit;

 * mssql+pyodbc://sa:***@MSSQLTest
5 rows affected.
Done.

[]

In [23]:
%%sql insert into dept(dept_no, dept_name, loc) values(10, 'HR', 'Chennai'),
    (20, 'Marketing', 'Hyberadad'),
    (30, 'Sales', 'Bangalore'),
    (40, 'Developer', 'Chennai');
    commit;

 * mssql+pyodbc://sa:***@MSSQLTest
4 rows affected.
Done.

[]

*查询employee表的所有记录*

In [26]:
%sql select * from employee;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(1001, 'Allen', 'Finch', None, None, None, 'J7', 10, None),
 (1002, 'Scott', 'Tigger', 1001, None, None, 'J2', 10, None),
 (1003, 'Martin', 'Blake', 1001, None, None, 'J3', 10, None),
 (1004, 'Arun', 'Turner', None, None, datetime.date(2008, 6, 5), 'J4', 20, Decimal('40000.0000')),
 (1005, 'John', 'Root', 1004, None, datetime.date(2010, 1, 10), 'J5', 20, None),
 (1006, 'Nithya', 'Jones', 1001, None, datetime.date(1999, 2, 12), 'J6', 30, Decimal('500000.0000')),
 (1007, 'Smith', 'Ruth', 1006, None, datetime.date(2010, 7, 21), 'J1', 10, Decimal('30000.0000')),
 (1008, 'Miller', 'Ward', 1001, None, None, 'J8', 40, None),
 (1009, 'Alex', 'Fin', None, None, None, 'J7', 30, None)]

*一下查两个表*<br>
*这个notebook不行*<br>

In [29]:
%sql select * from employee;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(1001, 'Allen', 'Finch', None, None, None, 'J7', 10, None),
 (1002, 'Scott', 'Tigger', 1001, None, None, 'J2', 10, None),
 (1003, 'Martin', 'Blake', 1001, None, None, 'J3', 10, None),
 (1004, 'Arun', 'Turner', None, None, datetime.date(2008, 6, 5), 'J4', 20, Decimal('40000.0000')),
 (1005, 'John', 'Root', 1004, None, datetime.date(2010, 1, 10), 'J5', 20, None),
 (1006, 'Nithya', 'Jones', 1001, None, datetime.date(1999, 2, 12), 'J6', 30, Decimal('500000.0000')),
 (1007, 'Smith', 'Ruth', 1006, None, datetime.date(2010, 7, 21), 'J1', 10, Decimal('30000.0000')),
 (1008, 'Miller', 'Ward', 1001, None, None, 'J8', 40, None),
 (1009, 'Alex', 'Fin', None, None, None, 'J7', 30, None)]

In [31]:
%sql select * from dept;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(10, 'HR', 'Chennai'),
 (20, 'Marketing', 'Hyberadad'),
 (30, 'Sales', 'Bangalore'),
 (40, 'Developer', 'Chennai')]

*只要前三行*

In [33]:
%sql select top(3) * from employee;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(1001, 'Allen', 'Finch', None, None, None, 'J7', 10, None),
 (1002, 'Scott', 'Tigger', 1001, None, None, 'J2', 10, None),
 (1003, 'Martin', 'Blake', 1001, None, None, 'J3', 10, None)]

*指定选择列，和别名*

In [35]:
%sql select dept_name, loc from dept;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[('HR', 'Chennai'),
 ('Marketing', 'Hyberadad'),
 ('Sales', 'Bangalore'),
 ('Developer', 'Chennai')]

In [37]:
%sql select dept_name, loc as location from dept;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[('HR', 'Chennai'),
 ('Marketing', 'Hyberadad'),
 ('Sales', 'Bangalore'),
 ('Developer', 'Chennai')]

*只查两列*

In [39]:
%sql select first_name, last_name from employee;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[('Allen', 'Finch'),
 ('Scott', 'Tigger'),
 ('Martin', 'Blake'),
 ('Arun', 'Turner'),
 ('John', 'Root'),
 ('Nithya', 'Jones'),
 ('Smith', 'Ruth'),
 ('Miller', 'Ward'),
 ('Alex', 'Fin')]

*top(5)*

In [41]:
%sql select top 5 first_name, last_name from employee;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[('Allen', 'Finch'),
 ('Scott', 'Tigger'),
 ('Martin', 'Blake'),
 ('Arun', 'Turner'),
 ('John', 'Root')]

*as实例*

In [43]:
%sql select dept_no, loc as location from dept;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(10, 'Chennai'), (20, 'Hyberadad'), (30, 'Bangalore'), (40, 'Chennai')]

*唯一值*

In [46]:
%sql select distinct loc from dept;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[('Bangalore',), ('Chennai',), ('Hyberadad',)]

*默认asc，可以不指定*

In [48]:
%sql select * from dept order by dept_no asc;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(10, 'HR', 'Chennai'),
 (20, 'Marketing', 'Hyberadad'),
 (30, 'Sales', 'Bangalore'),
 (40, 'Developer', 'Chennai')]

*descending，降序，40,30,20,10*

In [51]:
%sql select * from dept order by dept_no desc;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(40, 'Developer', 'Chennai'),
 (30, 'Sales', 'Bangalore'),
 (20, 'Marketing', 'Hyberadad'),
 (10, 'HR', 'Chennai')]

*查最后两条，可以用top + ordered by desc*

In [55]:
%sql select top(2) * from dept order by dept_no desc;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(40, 'Developer', 'Chennai'), (30, 'Sales', 'Bangalore')]

*逻辑与操作*

In [59]:
%sql select * from dept where dept_no=20 and dept_name='HR';

 * mssql+pyodbc://sa:***@MSSQLTest
0 rows affected.

[]

In [61]:
%sql select * from dept where dept_no=10 and dept_name='HR';

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(10, 'HR', 'Chennai')]

*逻辑或操作*

In [63]:
%sql select * from dept where dept_no=20 or dept_name='HR';

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(10, 'HR', 'Chennai'), (20, 'Marketing', 'Hyberadad')]

*逻辑非操作*

In [65]:
%sql select * from dept where loc not in ('Hyberadad');

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(10, 'HR', 'Chennai'),
 (30, 'Sales', 'Bangalore'),
 (40, 'Developer', 'Chennai')]

*between 操作符的例子*

In [67]:
%sql select * from employee where salary between 20000 and 35000;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(1007, 'Smith', 'Ruth', 1006, None, datetime.date(2010, 7, 21), 'J1', 10, Decimal('30000.0000'))]

*in 操作符例子*

In [72]:
%sql select * from dept where loc in ('Chennai', 'Bangalore');

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(10, 'HR', 'Chennai'),
 (30, 'Sales', 'Bangalore'),
 (40, 'Developer', 'Chennai')]

*基础操作符 >, < ==*

In [74]:
%sql select * from employee where salary > 20000;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(1004, 'Arun', 'Turner', None, None, datetime.date(2008, 6, 5), 'J4', 20, Decimal('40000.0000')),
 (1006, 'Nithya', 'Jones', 1001, None, datetime.date(1999, 2, 12), 'J6', 30, Decimal('500000.0000')),
 (1007, 'Smith', 'Ruth', 1006, None, datetime.date(2010, 7, 21), 'J1', 10, Decimal('30000.0000'))]

In [76]:
%sql select * from employee where salary=30000;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(1007, 'Smith', 'Ruth', 1006, None, datetime.date(2010, 7, 21), 'J1', 10, Decimal('30000.0000'))]

*Like条件* <br>
*模糊匹配*

In [78]:
%sql select * from dept where loc like 'C%';

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(10, 'HR', 'Chennai'), (40, 'Developer', 'Chennai')]

*loc  ends with "i"*

In [80]:
%sql select * from dept where loc like '%i';

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(10, 'HR', 'Chennai'), (40, 'Developer', 'Chennai')]

*c打头，i结尾，不区分大小写*

In [81]:
%sql select * from dept where loc like 'c%i';

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(10, 'HR', 'Chennai'), (40, 'Developer', 'Chennai')]